In [1]:
import pandas as pd

In [3]:
df1 = pd.read_csv("josaa_round1_nit_results.csv")
df2 = pd.read_csv("josaa_round2_nit_results.csv")
df3 = pd.read_csv("josaa_round3_nit_results.csv")
df4 = pd.read_csv("josaa_round4_nit_results.csv")
df5 = pd.read_csv("josaa_round5_nit_results.csv")

In [4]:
df1['round_number'] = 1
df2['round_number'] = 2
df3['round_number'] = 3
df4['round_number'] = 4
df5['round_number'] = 5

In [5]:
df1.head()

,Institute,Academic Program,Quota,Seat Type,Gender,Opening Rank,Closing Rank,round_number
0,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",HS,OPEN,Gender-Neutral,58313.0,65917.0,1
1,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",HS,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1
2,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",HS,EWS,Gender-Neutral,10180.0,10180.0,1
3,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",HS,EWS,Female-only (including Supernumerary),16293.0,16293.0,1
4,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",HS,OBC-NCL,Gender-Neutral,33291.0,52241.0,1

In [7]:
df1 = df1.drop('Quota',axis=1)
df2 = df2.drop('Quota',axis=1)
df3 = df3.drop('Quota',axis=1)
df4 = df4.drop('Quota',axis=1)
df5 = df5.drop('Quota',axis=1)

In [9]:
merged_df = pd.concat([df1, df2, df3, df4, df5], ignore_index=True)

In [14]:
merged_df["round_number"].unique()

array([1, 2, 3, 4, 5], dtype=int64)

In [15]:
merged_df = merged_df.rename(columns={
    "Institute": "institute",
    "Academic Program": "academic_program",
    "Seat Type": "seat_type",
    "Gender": "gender",
    "Opening Rank": "opening_rank",
    "Closing Rank": "closing_rank"
})

In [16]:
merged_df.head()

,institute,academic_program,seat_type,gender,opening_rank,closing_rank,round_number
0,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",OPEN,Gender-Neutral,58313.0,65917.0,1
1,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",OPEN,Female-only (including Supernumerary),53084.0,53648.0,1
2,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",EWS,Gender-Neutral,10180.0,10180.0,1
3,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",EWS,Female-only (including Supernumerary),16293.0,16293.0,1
4,Dr. B R Ambedkar National Institute of Technol...,"Bio Technology (4 Years, Bachelor of Technology)",OBC-NCL,Gender-Neutral,33291.0,52241.0,1

In [17]:
merged_df['program_name_'] = merged_df['academic_program'].str.extract(r'^(.*?)(?:\s*\(\d+ Years, .*?\))')[0].str.strip()

In [20]:
merged_df['duration'] = merged_df['academic_program'].str.extract(r'\((\d+ Years)')

In [22]:
merged_df['degree_raw'] = merged_df['academic_program'].str.extract(r'\,\s*(.*?)\)$')

In [25]:
merged_df['opening_rank'] = pd.to_numeric(merged_df['opening_rank'], errors='coerce')  # invalid values become NaN

# Optional: You can also do the same for 'closing_rank' if needed
merged_df['closing_rank'] = pd.to_numeric(merged_df['closing_rank'], errors='coerce')

In [45]:
merged_df.drop(columns=['academic_program'],inplace=True)

In [33]:
rf = pd.read_csv("rank_data_2.csv")

In [34]:
rf.head()

       institute       city          state  rank  college_id
0     IIT Madras    Chennai     Tamil Nadu     1           1
1      IIT Delhi  New Delhi          Delhi     2           2
2     IIT Bombay     Mumbai    Maharashtra     3           3
3     IIT Kanpur     Kanpur  Uttar Pradesh     4           4
4  IIT Kharagpur  Kharagpur    West Bengal     5           5

In [36]:
merged_df = merged_df.merge(rf[['institute', 'college_id']], on='institute', how='left')

In [46]:
merged_df.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name_,duration,degree_raw,college_id
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN

In [47]:
merged_df.to_csv('nit_data.csv', index=False)

In [52]:
gfti = pd.read_csv("gfti_data.csv")
nit = pd.read_csv("nit_data.csv")

In [49]:
gfti.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id
0,"Assam University, Silchar",OPEN,Gender-Neutral,39074,66923,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
1,"Assam University, Silchar",OPEN,Female-only (including Supernumerary),68243,68243,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
2,"Assam University, Silchar",OPEN (PwD),Gender-Neutral,1032,1032,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
3,"Assam University, Silchar",EWS,Gender-Neutral,10119,10958,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
4,"Assam University, Silchar",OBC-NCL,Gender-Neutral,21209,23389,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN

In [60]:
jee_main.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,nirf_rank
0,"Assam University, Silchar",OPEN,Gender-Neutral,39074.0,66923.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
1,"Assam University, Silchar",OPEN,Female-only (including Supernumerary),68243.0,68243.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
2,"Assam University, Silchar",OPEN (PwD),Gender-Neutral,1032.0,1032.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
3,"Assam University, Silchar",EWS,Gender-Neutral,10119.0,10958.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
4,"Assam University, Silchar",OBC-NCL,Gender-Neutral,21209.0,23389.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN

In [56]:
jee_main = pd.concat([gfti,nit], ignore_index = True)

In [3]:
import pandas as pd

In [6]:
jee_mains = pd.read_csv("jee_main_data.csv")
iiit = pd.read_csv("iiit_data.csv")

In [8]:
iiit = iiit.rename(columns={"college_id":"nirf_rank"})

In [10]:
jee_mains.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name_,duration,degree_raw,college_id
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN

In [61]:
merged_df.to_csv('jee_main_data.csv', index=False)

In [11]:
jee_mainss = pd.concat([jee_mains,iiit], ignore_index = True)

In [12]:
jee_mainss.to_csv('jee_mains_data.csv', index=False)

In [14]:
jee_mainss.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name_,duration,degree_raw,college_id,program_name,nirf_rank
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN

In [15]:
nit= pd.read_csv("nit_data.csv")
gfti = pd.read_csv("gfti_data.csv")
iiit = pd.read_csv("iiit_data.csv")

In [16]:
nit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN

In [17]:
gfti.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id
0,"Assam University, Silchar",OPEN,Gender-Neutral,39074,66923,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
1,"Assam University, Silchar",OPEN,Female-only (including Supernumerary),68243,68243,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
2,"Assam University, Silchar",OPEN (PwD),Gender-Neutral,1032,1032,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
3,"Assam University, Silchar",EWS,Gender-Neutral,10119,10958,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
4,"Assam University, Silchar",OBC-NCL,Gender-Neutral,21209,23389,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN

In [19]:
iiit.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id
0,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN,Gender-Neutral,5514,7835,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN
1,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN,Female-only (including Supernumerary),9323,14651,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN
2,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN (PwD),Gender-Neutral,129,129,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN
3,Atal Bihari Vajpayee Indian Institute of Infor...,OPEN (PwD),Female-only (including Supernumerary),481,481,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN
4,Atal Bihari Vajpayee Indian Institute of Infor...,EWS,Gender-Neutral,1014,1053,1,Computer Science and Engineering,4 Years,Bachelor of Technology,NaN

In [20]:
jee = pd.concat([gfti,nit,iiit], ignore_index = True)

In [24]:
jee.head()

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,nirf_rank
0,"Assam University, Silchar",OPEN,Gender-Neutral,39074.0,66923.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
1,"Assam University, Silchar",OPEN,Female-only (including Supernumerary),68243.0,68243.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
2,"Assam University, Silchar",OPEN (PwD),Gender-Neutral,1032.0,1032.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
3,"Assam University, Silchar",EWS,Gender-Neutral,10119.0,10958.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN
4,"Assam University, Silchar",OBC-NCL,Gender-Neutral,21209.0,23389.0,1,Agricultural Engineering,4 Years,Bachelor of Technology,NaN

In [23]:
jee = jee.rename(columns={"college_id":"nirf_rank"})

In [ ]:
jee.to_csv('jee_mains.csv', index=False)

In [1]:
import pandas as pd
nit = pd.read_csv("nit_data.csv")
nit_placement = pd.read_csv("NITs_Placement_Data.csv")

In [13]:
nit["institute"]
#'Dr. B R Ambedkar National Institute of Technology, Jalandhar'

0        Dr. B R Ambedkar National Institute of Technol...
1        Dr. B R Ambedkar National Institute of Technol...
2        Dr. B R Ambedkar National Institute of Technol...
3        Dr. B R Ambedkar National Institute of Technol...
4        Dr. B R Ambedkar National Institute of Technol...
                               ...
31476    Indian Institute of Engineering Science and Te...
31477    Indian Institute of Engineering Science and Te...
31478    Indian Institute of Engineering Science and Te...
31479    Indian Institute of Engineering Science and Te...
31480    Indian Institute of Engineering Science and Te...
Name: institute, Length: 31481, dtype: object

In [6]:
nit_placement = nit_placement.rename(columns={"Name of NITs":"institute"})

In [14]:
nit_placement.to_csv('NITs_Placement_Data.csv', index=False)

In [10]:
nit_placement["institute"][0]

'Dr B R Ambedkar National Institute of Technology, Jalandhar'

In [11]:
merged_df = nit.merge(nit_placement, on="institute", how="left")

In [12]:
merged_df

,institute,seat_type,gender,opening_rank,closing_rank,round_number,program_name,duration,degree_raw,college_id,Average Domestic Package (LPA),Highest Domestic Package (LPA)
0,Dr. B R Ambedkar National Institute of Technol...,OPEN,Gender-Neutral,58313.0,65917.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
1,Dr. B R Ambedkar National Institute of Technol...,OPEN,Female-only (including Supernumerary),53084.0,53648.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
2,Dr. B R Ambedkar National Institute of Technol...,EWS,Gender-Neutral,10180.0,10180.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
3,Dr. B R Ambedkar National Institute of Technol...,EWS,Female-only (including Supernumerary),16293.0,16293.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
4,Dr. B R Ambedkar National Institute of Technol...,OBC-NCL,Gender-Neutral,33291.0,52241.0,1,Bio Technology,4 Years,Bachelor of Technology,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
31476,Indian Institute of Engineering Science and Te...,EWS,Gender-Neutral,7951.0,7990.0,5,Mining Engineering,4 Years,Bachelor of Technology,NaN,NaN,NaN
31477,Indian Institute of Engineering Science and Te...,OBC-NCL,Gender-Neutral,16368.0,17526.0,5,Mining Engineering,4 Years,Bachelor of Technology,NaN,NaN,NaN
31478,Indian Institute of Engineering Science and Te...,OBC-NCL,Female-only (including Supernumerary),24814.0,25370.0,5,Mining Engineering,4 Years,Bachelor of Technology,NaN,NaN,NaN
31479,Indian Institute of Engineering Science and Te...,SC,Gender-Neutral,8185.0,9350.0,5,Mining Engineering,4 Years,Bachelor of Technology,NaN,NaN,NaN
31480,Indian Institute of Engineering Science and Te...,ST,Gender-Neutral,3185.0,3209.0,5,Mining Engineering,4 Years,Bachelor of Technology,NaN,NaN,NaN